{"keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "batch_input_shape": [null, 50, 160, 1], "init": "glorot_uniform", "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "activation": "linear", "input_dtype": "float32", "dim_ordering": "tf", "trainable": true, "nb_row": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.3}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "b_regularizer": null, "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "nb_filter": 32, "nb_col": 3, "W_regularizer": null, "activation": "linear", "trainable": true, "nb_row": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": null, "output_dim": 1000, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": null, "output_dim": 50, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": null, "output_dim": 1, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_3"}}], "class_name": "Sequential"}